Revit 2027 API
ExportUtils.GetExportId(Subelement) Method
 Retrieves the GUID representing the subelement in DWF and IFC export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid GetExportId(
	Subelement subelement
)
Public Shared Function GetExportId (
	subelement As Subelement
) As Guid
public:
static Guid GetExportId(
	Subelement^ subelement
)
static member GetExportId :
        subelement : Subelement -> Guid
Parameters
subelement Subelement
 The subelement.
Return Value
Guid
 The value of the GUID representing the subelement in the export context.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This id is used in the contents of DWF export and IFC export and it should be used only when cross-referencing to the contents of these export formats. When storing Ids that will need to be mapped back to subelements in future sessions, UniqueId must be used.
See Also
Reference
ExportUtils Class
GetExportId Overload
Autodesk.Revit.DB Namespace